// 시간 초과.

// 15646
/*
문제
농부 후안은 바리스타입니다. 후안은 N × M 크기의 커피 농장을 소유하고 있습니다. 
후안은 Q번 농장에 씨앗을 심거나 심은 씨앗의 영양의 합을 확인할 것입니다. 
후안은 자신의 농장을 관리해줄 자동화 시스템이 필요합니다. 후안을 도와줍시다. 
프로그램은 다음과 같은 두 동작을 수행해야 합니다.

씨앗 심기 : x 좌표가 [x1,x2]에 포함되고 y 좌표가 [y1,y2]에 포함되는 모든 위치에 영양이 d인 씨앗을 1개 심습니다.
씨앗 개수 확인하기 : (x,y) 위치에 심은 씨앗의 영양의 합을 확인합니다.
입력
N, M, Q가 첫 줄에 주어집니다. (1 ≤ N, M ≤ 5000, 0 ≤ Q ≤ 2 × 105)

Q개의 줄 동안 수행해야 하는 동작이 주어집니다.

첫 번째로 주어지는 숫자가 1이면 이는 씨앗을 심는 동작임을 뜻하며, 5개의 수 x1, y1, x2, y2, d가 주어집니다. 
(1 ≤ x1 ≤ x2 ≤ N, 1 ≤ y1 ≤ y2 ≤ M,  - 109 ≤ d ≤ 109)

첫 번째로 주어지는 숫자가 2이면 이는 씨앗의 영양의 합을 확인하는 동작임을 뜻하며, 2개의 수 x와 y가 주어집니다. 
(1 ≤ x ≤ N, 1 ≤ y ≤ M)

출력
모든 씨앗 개수를 확인하는 동작에 대해, 각각의 결과를 한 줄마다 출력합니다.
*/

#include <stdio.h>

using namespace std;

int farm[5001][5001];

int main(){
    
    int N, M, Q;
    
    scanf("%d %d %d", &N, &M, &Q);
    
    while(Q > 0){
        int temp;
        scanf("%d", &temp);
        if(temp == 1){
            int x1, x2, y1, y2, d;
            scanf("%d %d %d %d %d", &x1, &y1, &x2, &y2, &d);
            for(int x=x1;x<=x2; x++){
                for(int y=y1; y<=y2; y++){
                    farm[x][y] += d;
                }
            }
        }
        else{
            int x, y;
            scanf("%d %d", &x, &y);
            printf("%d\n", farm[x][y]);
        }
        Q--;
    }
    
    return 0;
}
